<a href="https://colab.research.google.com/github/RudinP/SOLUX_Summer_data_study/blob/master/1%EC%A3%BC%EC%B0%A8/%EC%B1%95%ED%84%B03(0725).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd #pandas 모듈을 pd라고 사용, 즉 하단의 pd,~는 원래 전부 pandas. 으로 적었어야 구동이 되었던 것

In [ ]:
friend_dict_list=[
    {'name':'John','age':25,'job':'student'},
    {'name':'Nate','age':30,'job':'teacher'}
]#데이터프레임으 만들기 위함

In [ ]:
df=pd.DataFrame(friend_dict_list)#데이터프레임 생성

In [ ]:
df.head()#데이터프레임 표시(df.tail()하면 뒤 꼬리들이 나오는 방식이나, 안에 숫자 제한이 없기 때문에 동일하게 표시될것

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [ ]:
df = df[['name','age','job']]#내 데이터프레임같은 경우에는 운 좋게 name, age, job 순서대로 나왔으나 원래는 딕셔너리이기 때문에 순서에 맞지 않게 나왔을것, 이를 조정하기 위해 name, age, job 순으로 데이터프레임을 만들도록 지정

In [ ]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [ ]:
from collections import OrderedDict#내장함수인것같다

In [ ]:
friend_ordered_dict=OrderedDict(
[
    ('name',['John','Nate']),
    ('age',[25,30]),
    ('job',['student','teacher'])
])#이 순서대로 데이터프레임이 만들어지도록 한번에 설정

In [ ]:
df=pd.DataFrame.from_dict(friend_ordered_dict)

In [ ]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [ ]:
friend_list=[
    ['John',20,'student']
    ,['Nate',30,'teacher']
]

In [ ]:
column_name = ['name','age','job']#칼럼 네임을 후에 따로 설정하는 방법

In [ ]:
df = pd.DataFrame.from_records(friend_list, columns=column_name)

In [ ]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
friend_list2 =[
    ['name',['John','Nate']],
    ['age',[20,30]],
    ['job',['student','teacher']]
]

In [ ]:
df=pd.DataFrame.from_items(friend_list2)#from_items는 라이브러리에서 삭제되었기 때문에 오류가 난다

AttributeError: type object 'DataFrame' has no attribute 'from_items'